IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_analog_subsys_regs.xml
<module id="ANALOG_SUBSYS_REGS" HW_revision="" description="ANALOG SUBSYS Registers">
	<register id="INTERNALTESTCTL" width="32" page="1" offset="0x4a" internal="0" description="INTERNALTEST Node Control Register">
		<bitfield id="TESTSEL" description="Test Select" begin="5" end="0" width="6" rwaccess="RW"/>
		<bitfield id="KEY" description="Key to Enable writes" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="CONFIGLOCK" width="32" page="1" offset="0x5e" internal="0" description="Lock Register for all the config registers.">
		<bitfield id="AGPIOFILTER" description="Locks AGPIOFILTER Register" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="AGPIOCTRL" description="Locks all AGPIOCTRL Register" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIOINENACTRL" description="Locks all GPIOINENACTRL Register" begin="6" end="6" width="1" rwaccess="RW"/>
	</register>
	<register id="TSNSCTL" width="16" page="1" offset="0x60" internal="0" description="Temperature Sensor Control Register">
		<bitfield id="ENABLE" description="Temperature Sensor Enable" begin="0" end="0" width="1" rwaccess="RW"/>
	</register>
	<register id="ANAREFCTL" width="16" page="1" offset="0x68" internal="0" description="Analog Reference Control Register.">
		<bitfield id="ANAREFASEL" description="Analog Reference Select" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ANAREFBSEL" description="Analog Reference B Select" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ANAREFCSEL" description="Analog Reference C Select" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="ANAREFA2P5SEL" description="Analog Reference Select" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="ANAREFB2P5SEL" description="Analog Reference B Select" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="ANAREFC2P5SEL" description="Analog Reference C Select" begin="10" end="10" width="1" rwaccess="RW"/>
	</register>
	<register id="VMONCTL" width="16" page="1" offset="0x70" internal="0" description="Voltage Monitor Control Register">
		<bitfield id="BORLVMONDIS" description="Disable BORL(ow) feature on VDDIO" begin="8" end="8" width="1" rwaccess="RW"/>
	</register>
	<register id="CMPHPMXSEL" width="32" page="1" offset="0x82" internal="0" description="Bits to select one of the many sources on CopmHP inputs. Refer to Pimux diagram for details.">
		<bitfield id="CMP1HPMXSEL" description="CMP1HPMXSEL bits" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CMP2HPMXSEL" description="CMP2HPMXSEL bits" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="CMP3HPMXSEL" description="CMP3HPMXSEL bits" begin="8" end="6" width="3" rwaccess="RW"/>
		<bitfield id="CMP4HPMXSEL" description="CMP4HPMXSEL bits" begin="11" end="9" width="3" rwaccess="RW"/>
		<bitfield id="CMP5HPMXSEL" description="CMP5HPMXSEL bits" begin="14" end="12" width="3" rwaccess="RW"/>
		<bitfield id="CMP6HPMXSEL" description="CMP6HPMXSEL bits" begin="17" end="15" width="3" rwaccess="RW"/>
		<bitfield id="CMP7HPMXSEL" description="CMP7HPMXSEL bits" begin="20" end="18" width="3" rwaccess="RW"/>
		<bitfield id="CMP8HPMXSEL" description="CMP8HPMXSEL bits" begin="23" end="21" width="3" rwaccess="RW"/>
		<bitfield id="CMP9HPMXSEL" description="CMP9HPMXSEL bits" begin="26" end="24" width="3" rwaccess="RW"/>
		<bitfield id="CMP10HPMXSEL" description="CMP10HPMXSEL bits" begin="29" end="27" width="3" rwaccess="RW"/>
	</register>
	<register id="CMPLPMXSEL" width="32" page="1" offset="0x84" internal="0" description="Bits to select one of the many sources on CopmLP inputs. Refer to Pimux diagram for details.">
		<bitfield id="CMP1LPMXSEL" description="CMP1LPMXSEL bits" begin="2" end="0" width="3" rwaccess="RW"/>
		<bitfield id="CMP2LPMXSEL" description="CMP2LPMXSEL bits" begin="5" end="3" width="3" rwaccess="RW"/>
		<bitfield id="CMP3LPMXSEL" description="CMP3LPMXSEL bits" begin="8" end="6" width="3" rwaccess="RW"/>
		<bitfield id="CMP4LPMXSEL" description="CMP4LPMXSEL bits" begin="11" end="9" width="3" rwaccess="RW"/>
		<bitfield id="CMP5LPMXSEL" description="CMP5LPMXSEL bits" begin="14" end="12" width="3" rwaccess="RW"/>
		<bitfield id="CMP6LPMXSEL" description="CMP6LPMXSEL bits" begin="17" end="15" width="3" rwaccess="RW"/>
		<bitfield id="CMP7LPMXSEL" description="CMP7LPMXSEL bits" begin="20" end="18" width="3" rwaccess="RW"/>
		<bitfield id="CMP8LPMXSEL" description="CMP8LPMXSEL bits" begin="23" end="21" width="3" rwaccess="RW"/>
		<bitfield id="CMP9LPMXSEL" description="CMP9LPMXSEL bits" begin="26" end="24" width="3" rwaccess="RW"/>
		<bitfield id="CMP10LPMXSEL" description="CMP10LPMXSEL bits" begin="29" end="27" width="3" rwaccess="RW"/>
	</register>
	<register id="CMPHNMXSEL" width="16" page="1" offset="0x86" internal="0" description="Bits to select one of the many sources on CopmHN inputs. Refer to Pimux diagram for details.">
		<bitfield id="CMP1HNMXSEL" description="CMP1HNMXSEL bits" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CMP2HNMXSEL" description="CMP2HNMXSEL bits" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CMP3HNMXSEL" description="CMP3HNMXSEL bits" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CMP4HNMXSEL" description="CMP4HNMXSEL bits" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CMP5HNMXSEL" description="CMP5HNMXSEL bits" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CMP6HNMXSEL" description="CMP6HNMXSEL bits" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CMP7HNMXSEL" description="CMP7HNMXSEL bits" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CMP8HNMXSEL" description="CMP8HNMXSEL bits" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="CMP9HNMXSEL" description="CMP9HNMXSEL bits" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CMP10HNMXSEL" description="CMP10HNMXSEL bits" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CMP11HNMXSEL" description="CMP11HNMXSEL bits" begin="10" end="10" width="1" rwaccess="RW"/>
	</register>
	<register id="CMPLNMXSEL" width="16" page="1" offset="0x87" internal="0" description="Bits to select one of the many sources on CopmLN inputs. Refer to Pimux diagram for details.">
		<bitfield id="CMP1LNMXSEL" description="CMP1LNMXSEL bits" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CMP2LNMXSEL" description="CMP2LNMXSEL bits" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="CMP3LNMXSEL" description="CMP3LNMXSEL bits" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CMP4LNMXSEL" description="CMP4LNMXSEL bits" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="CMP5LNMXSEL" description="CMP5LNMXSEL bits" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="CMP6LNMXSEL" description="CMP6LNMXSEL bits" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CMP7LNMXSEL" description="CMP7LNMXSEL bits" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CMP8LNMXSEL" description="CMP8LNMXSEL bits" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="CMP9LNMXSEL" description="CMP9LNMXSEL bits" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="CMP10LNMXSEL" description="CMP10LNMXSEL bits" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CMP11LNMXSEL" description="CMP11LNMXSEL bits" begin="10" end="10" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCDACLOOPBACK" width="32" page="1" offset="0x88" internal="0" description="Enabble loopback from DAC to ADCs">
		<bitfield id="ENLB2ADCA" description="Enable COMPDACA loopback to ADCA" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ENLB2ADCB" description="Enable COMPDACA loopback to ADCB" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ENLB2ADCC" description="Enable COMPDACA loopback to ADCC" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="Key to enable writes" begin="31" end="16" width="16" rwaccess="RW"/>
	</register>
	<register id="LOCK" width="32" page="1" offset="0x8e" internal="0" description="Lock Register">
		<bitfield id="TSNSCTL" description="TSNSCTL Register lock bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ANAREFCTL" description="ANAREFCTL Register lock bit" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="VMONCTL" description="VMONCTL Register lock bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="CMPHPMXSEL" description="CMPHPMXSEL Register lock bit" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="CMPLPMXSEL" description="CMPLPMXSEL Register lock bit" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="CMPHNMXSEL" description="CMPHNMXSEL Register lock bit" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="CMPLNMXSEL" description="CMPLNMXSEL Register lock bit" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="VREGCTL" description="VREGCTL Register lock bit" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="CMPSSCTL" description="CMPSSCTL Register lock bit" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="CMPHPMXSEL1" description="CMPHPMXSEL1 Register lock bit" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="CMPLPMXSEL1" description="CMPLPMXSEL1 Register lock bit" begin="12" end="12" width="1" rwaccess="RW"/>
	</register>
	<register id="CMPHPMXSEL1" width="32" page="1" offset="0x90" internal="0" description="Bits to select one of the many sources on CopmHP inputs. Refer to Pimux diagram for details.">
		<bitfield id="CMP11HPMXSEL" description="CMP15HPMXSEL bits" begin="2" end="0" width="3" rwaccess="RW"/>
	</register>
	<register id="CMPLPMXSEL1" width="32" page="1" offset="0x92" internal="0" description="Bits to select one of the many sources on CopmLP inputs. Refer to Pimux diagram for details.">
		<bitfield id="CMP11LPMXSEL" description="CMP15LPMXSEL bits" begin="2" end="0" width="3" rwaccess="RW"/>
	</register>
	<register id="ADCSOCFRCGB" width="32" page="1" offset="0x10e" internal="0" description="ADC Global SOC Force">
		<bitfield id="SOC0" description="Generate synchronous SW trigger for SOC0" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="SOC1" description="Generate synchronous SW trigger for SOC1" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="SOC2" description="Generate synchronous SW trigger for SOC2" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="SOC3" description="Generate synchronous SW trigger for SOC3" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="SOC4" description="Generate synchronous SW trigger for SOC4" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="SOC5" description="Generate synchronous SW trigger for SOC5" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="SOC6" description="Generate synchronous SW trigger for SOC6" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="SOC7" description="Generate synchronous SW trigger for SOC7" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="SOC8" description="Generate synchronous SW trigger for SOC8" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="SOC9" description="Generate synchronous SW trigger for SOC9" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="SOC10" description="Generate synchronous SW trigger for SOC10" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="SOC11" description="Generate synchronous SW trigger for SOC11" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="SOC12" description="Generate synchronous SW trigger for SOC12" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="SOC13" description="Generate synchronous SW trigger for SOC13" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="SOC14" description="Generate synchronous SW trigger for SOC14" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="SOC15" description="Generate synchronous SW trigger for SOC15" begin="15" end="15" width="1" rwaccess="RW"/>
	</register>
	<register id="ADCSOCFRCGBSEL" width="16" page="1" offset="0x110" internal="0" description="ADC Global SOC Force Select">
		<bitfield id="ADCA" description="Generate synchronous SW trigger for ADCA" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="ADCB" description="Generate synchronous SW trigger for ADCB" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="ADCC" description="Generate synchronous SW trigger for ADCC" begin="2" end="2" width="1" rwaccess="RW"/>
	</register>
	<register id="AGPIOFILTER" width="16" page="1" offset="0x111" internal="0" description="AGPIO Filter Control Register">
		<bitfield id="RIGHT" description="AGPIOFILTER Control for right side pins" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="BOTTOM" description="AGPIOFILTER Control for bottom side pins" begin="9" end="8" width="2" rwaccess="RW"/>
	</register>
	<register id="AGPIOCTRLG" width="32" page="1" offset="0x120" internal="0" description="AGPIO Control Register">
		<bitfield id="GPIO198" description="AGPIOCTRL for GPIO198" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO199" description="AGPIOCTRL for GPIO199" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO200" description="AGPIOCTRL for GPIO200" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO201" description="AGPIOCTRL for GPIO201" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO202" description="AGPIOCTRL for GPIO202" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO203" description="AGPIOCTRL for GPIO203" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO204" description="AGPIOCTRL for GPIO204" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO205" description="AGPIOCTRL for GPIO205" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO206" description="AGPIOCTRL for GPIO206" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO207" description="AGPIOCTRL for GPIO207" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO208" description="AGPIOCTRL for GPIO208" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO209" description="AGPIOCTRL for GPIO209" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO210" description="AGPIOCTRL for GPIO210" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO211" description="AGPIOCTRL for GPIO211" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO212" description="AGPIOCTRL for GPIO212" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO213" description="AGPIOCTRL for GPIO213" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO214" description="AGPIOCTRL for GPIO214" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO215" description="AGPIOCTRL for GPIO215" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO216" description="AGPIOCTRL for GPIO216" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO217" description="AGPIOCTRL for GPIO217" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO218" description="AGPIOCTRL for GPIO218" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO219" description="AGPIOCTRL for GPIO219" begin="27" end="27" width="1" rwaccess="RW"/>
	</register>
	<register id="AGPIOCTRLH" width="32" page="1" offset="0x122" internal="0" description="AGPIO Control Register">
		<bitfield id="GPIO224" description="AGPIOCTRL for GPIO224" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO225" description="AGPIOCTRL for GPIO225" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO226" description="AGPIOCTRL for GPIO226" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO227" description="AGPIOCTRL for GPIO227" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO228" description="AGPIOCTRL for GPIO228" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO229" description="AGPIOCTRL for GPIO229" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO230" description="AGPIOCTRL for GPIO230" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO231" description="AGPIOCTRL for GPIO231" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO232" description="AGPIOCTRL for GPIO232" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO233" description="AGPIOCTRL for GPIO233" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO234" description="AGPIOCTRL for GPIO234" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO235" description="AGPIOCTRL for GPIO235" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO236" description="AGPIOCTRL for GPIO236" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO237" description="AGPIOCTRL for GPIO237" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO238" description="AGPIOCTRL for GPIO238" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO239" description="AGPIOCTRL for GPIO239" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO240" description="AGPIOCTRL for GPIO240" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO241" description="AGPIOCTRL for GPIO241" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO242" description="AGPIOCTRL for GPIO242" begin="18" end="18" width="1" rwaccess="RW"/>
	</register>
	<register id="GPIOINENACTRL" width="32" page="1" offset="0x134" internal="0" description="GPIOINENACTRL Control Register">
		<bitfield id="GPIO0" description="Input Buffer Control for GPIO0" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO23" description="Input Buffer Control for GPIO23" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO25" description="Input Buffer Control for GPIO25" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO31" description="Input Buffer Control for GPIO31" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO46" description="Input Buffer Control for GPIO46" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO103" description="Input Buffer Control for GPIO103" begin="5" end="5" width="1" rwaccess="RW"/>
	</register>
</module>
